{
  "review": {
    "id": 1579647,
    "resource_id": 2664,
    "resource_url": "http://www.caring.test/senior-living/california/san-francisco/grove-street-extended-care-and-living-center-94117",
    "resource_name": "Grove Street Extended Care and Living Center",
    "chain_name": null,
    "title": "I am a friend or relative of a current/past resident",
    "content": "My grandmother and grandfather stayed at this facility for several years until they expired. I visited them almost daily. This review is a tribute to them.\r\nOverall I am very happy with the services they received and I am grateful to the staff for providing excellent care to my grandparents. \r\nThe best part about this place is physical therapy. The therapy was available 7 days per week and the therapy staff was excellent. Everybody were caring, encouraging and patient. The results also exceeded my expectations and certainly prolonged my grandparents’ life.\r\nThe nursing staff speaks different languages and my grandparents who spoke very little English had no problems communicating and participating in activities. The facility did several BBQs and Holiday meals that all residents enjoyed. \r\nAll staff members were nice to us and happy to accommodate our requests.\r\nThe building has large footprint with a lot of room to move around. The rooms are also nice and each room has own bathroom, which was great. You do not feel claustrophobic in that building, like in some other smaller building I have visited. \r\nThe condition of the building was similar to other San Francisco older buildings. I observed maintenance crew constantly working on renovating the building. The room my grandparents stayed in had a flat screen TV which looked like it was installed recently. The building also had WiFi internet that I was able to use.\r\nThe housekeepers came in every days and did an amazing job cleaning our room. I did not notice any smells in the building. I personally did not see any pests, but I would not be surprised because pests is a common problem in San Francisco. I did enquired staff about pests and I was told that the building has infection control policies in place. We were constantly reminded not to leave food outside for long periods of time. I have no complains about the accommodations.\r\nI would rate food 4 out of 5. I tried the food myself and it was very good and on some days impressive. The building had many ethnic groups and the staff tried to accommodate tastes of diverse population. The Register Dietician speaks English and Cantonese. She visited us many times to make sure the grandparents were happy with the food.  The staff also regularly monitored the grandparent’s weight and offered shakes and supplements.  My grandparents were picky eaters and not very compliant patients. They did not want to stay with the diet recommended by their doctor and the dietician. Hence, to make sure they eat was a challenge. The staff would also bring extra chicken for my grandfather, when requested, and was also very helpful in assisting with the feeding. Especial thanks is to Min Q. who was their CNA. \r\nMy advice to you, ask if you want something and these people will gladly accommodate your reasonable requests. Also, escalate to Administrator, Director of Nursing or the owners (owners are there every day), if you do not like something or need special accommodations. You are also welcome to email me at alex67@jsymphony.com if you have any comments or questions.",
    "rating": 5.0,
    "staff_score": 5.0,
    "activities_score": 5.0,
    "food_score": 4.0,
    "facilities_score": 4.0,
    "value_score": 5.0,
    "provider_response": null,
    "moderation_status": "unmoderated",
    "rejection_reason": null,
    "moderated_at": null,
    "author": {
      "name": "Alex67",
      "email": "2b1415638b5dc475@example.com",
      "url": "https://www.caring.com/people/alex67"
    },
    "origin_url": null,
    "created_at": "2019-05-17T01:58:37.000-07:00",
    "updated_at": "2019-05-17T02:10:34.000-07:00"
  }
}